In [2]:
import numpy as np
import pandas as pd
import scipy
import seaborn as sns
import matplotlib.pyplot as plt
import psycopg2
import get_data

In [3]:
engine = get_data.engine

In [12]:
df = pd.read_sql_query('SELECT datadate,gvkey,cusip,SALEQ,RECTQ FROM quarterly',engine)
df.tail()

          datadate   gvkey      cusip   saleq     rectq
194942  2012-06-30  028967  74727A104  23.540  1190.229
194943  2012-09-30  028967  74727A104  23.025  1218.590
194944  2012-12-31  028967  74727A104  23.460  1262.886
194945  2013-03-31  028967  74727A104  22.891  1268.765
194946  2001-12-31  029359  866674104  37.791   105.393

In [14]:
df = df[(df['saleq'] > 0)]
df = df[(df['rectq'] > 0)]

In [15]:
df = df.dropna()

In [16]:
df["ar_turnover_ratio"] = df["saleq"] / df["rectq"]

In [17]:
df.head()

     datadate   gvkey      cusip   saleq     rectq  ar_turnover_ratio
0  2013-06-30  028967  74727A104  25.248  1507.486           0.016748
1  2013-09-30  028967  74727A104  27.930  1515.876           0.018425
2  2013-12-31  028967  74727A104  26.592  1437.473           0.018499
3  2014-03-31  028967  74727A104  25.782  1469.634           0.017543
4  2014-06-30  028967  74727A104  26.538  1524.999           0.017402